In [1]:
people = {
    'first': ['Corey', 'Jane', 'John'], 
    'last': ['Schafer', 'Doe', 'Doe'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [5]:
df['first'] + ' '  + df['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [6]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [7]:
df['full_name'] = df['first'] + ' '  + df['last']

In [8]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [9]:
df.drop(columns=['first', 'last'], inplace=True)

In [10]:
df

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [11]:
df['full_name'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [12]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [13]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [14]:
df._append({'first': 'Amr'}, ignore_index=True)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN    Amr      NaN

In [15]:
people = {
    'first': ['Hassan', 'Ahmed'],
    'last': ['Alaa', 'Mohmaed'], 
    'email': ['amerAlnas@gmai.com', 'amiraMohamed@gmail.com']
}

In [16]:
df2 = pd.DataFrame(people)

In [17]:
df2

    first     last                   email
0  Hassan     Alaa      amerAlnas@gmai.com
1   Ahmed  Mohmaed  amiraMohamed@gmail.com

In [18]:
df._append(df2)

                     email      full_name   first     last
0  CoreyMSchafer@gmail.com  Corey Schafer   Corey  Schafer
1        JaneDoe@email.com       Jane Doe    Jane      Doe
2        JohnDoe@email.com       John Doe    John      Doe
0       amerAlnas@gmai.com            NaN  Hassan     Alaa
1   amiraMohamed@gmail.com            NaN   Ahmed  Mohmaed

In [19]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [20]:
df = df._append(df2, sort=True)

In [21]:
df

                     email   first      full_name     last
0  CoreyMSchafer@gmail.com   Corey  Corey Schafer  Schafer
1        JaneDoe@email.com    Jane       Jane Doe      Doe
2        JohnDoe@email.com    John       John Doe      Doe
0       amerAlnas@gmai.com  Hassan            NaN     Alaa
1   amiraMohamed@gmail.com   Ahmed            NaN  Mohmaed

In [22]:
df.drop(index=2, inplace=True)

In [23]:
df

                     email   first      full_name     last
0  CoreyMSchafer@gmail.com   Corey  Corey Schafer  Schafer
1        JaneDoe@email.com    Jane       Jane Doe      Doe
0       amerAlnas@gmai.com  Hassan            NaN     Alaa
1   amiraMohamed@gmail.com   Ahmed            NaN  Mohmaed

In [24]:
filt = df['last'] == 'Alaa'
df.drop(index=df[filt].index)

                    email  first full_name     last
1       JaneDoe@email.com   Jane  Jane Doe      Doe
1  amiraMohamed@gmail.com  Ahmed       NaN  Mohmaed